micropython/micropython/ports/psoc-edge/machine_uart.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2026 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// This file is never compiled standalone, it's included directly from
// extmod/machine_uart.c via MICROPY_PY_MACHINE_UART_INCLUDEFILE.

// std includes
#include <string.h>

// MTB / PDL includes
#include "cybsp.h"
#include "cy_scb_uart.h"
#include "cy_scb_common.h"
#include "cy_sysclk.h"

// MicroPython includes
#include "py/ringbuf.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "py/stream.h"

// Port-specific includes
#include "genhdr/pins_af.h"
#include "modmachine.h"
#include "machine_scb.h"
#include "sys_int.h"

/******************************************************************************/
// Defaults and constants

#define uart_assert_raise_val(msg, ret)   if (ret != CY_SCB_UART_SUCCESS) { \
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT(msg), ret); \
}

// Class-level constants exposed to Python
#define MICROPY_PY_MACHINE_UART_CLASS_CONSTANTS \
    { MP_ROM_QSTR(MP_QSTR_IRQ_RXIDLE), MP_ROM_INT(CY_SCB_RX_INTR_NOT_EMPTY) }, \
    { MP_ROM_QSTR(MP_QSTR_IRQ_BREAK), MP_ROM_INT(CY_SCB_RX_INTR_UART_BREAK_DETECT) }, \
    { MP_ROM_QSTR(MP_QSTR_IRQ_TXIDLE), MP_ROM_INT(CY_SCB_TX_INTR_UART_DONE) }, \

/**
 * TODO: Enable CTS/RTS class constants and flow control settings

    { MP_ROM_QSTR(MP_QSTR_RTS), MP_ROM_INT(UART_FLOW_CONTROL_RTS) }, \
    { MP_ROM_QSTR(MP_QSTR_CTS), MP_ROM_INT(UART_FLOW_CONTROL_CTS) }, \
 */

/******************************************************************************/

typedef struct _machine_uart_obj_t {
    mp_obj_base_t base;
    uint8_t id;                       // Private variable in this port. ID not associated to any port pin UART group.
    machine_scb_obj_t *scb_obj;
    mp_hal_pin_obj_t tx;
    mp_hal_pin_obj_t rx;
    mp_hal_pin_obj_t rts;
    mp_hal_pin_obj_t cts;
    uint32_t baudrate;
    uint32_t flow;
    uint8_t bits;
    uint8_t parity;
    uint8_t stop;
    uint32_t timeout_ms;
    uint32_t timeout_char_ms;
    cy_stc_scb_uart_context_t ctx;
    ringbuf_t rx_ringbuf;
    #if MICROPY_PY_MACHINE_UART_IRQ
    uint32_t mp_irq_trigger;
    uint32_t mp_irq_flags;
    mp_irq_obj_t *mp_irq_obj;
    #endif
} machine_uart_obj_t;

static machine_uart_obj_t *mp_machine_uart_alloc(uint8_t uart_id) {
    (void)uart_id;
    machine_uart_obj_t *self = NULL;
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_UART_NUM_ENTRIES; i++) {
        if (MP_STATE_PORT(machine_uart_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_uart_obj_t, &machine_uart_type);
            MP_STATE_PORT(machine_uart_obj[i]) = self;
            self->id = i;
            break;
        }
    }

    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available UART instances are allocated"));
    }

    return self;
}

static void mp_machine_uart_free(machine_uart_obj_t *self) {
    MP_STATE_PORT(machine_uart_obj[self->id]) = NULL;
}

MP_REGISTER_ROOT_POINTER(struct _machine_uart_obj_t *machine_uart_obj[MICROPY_PY_MACHINE_UART_NUM_ENTRIES]);

#if MICROPY_PY_MACHINE_UART_IRQ
static void machine_uart_irq_rx_idle(machine_uart_obj_t *self);
static void machine_uart_irq_rx_break(machine_uart_obj_t *self);
static void machine_uart_irq_tx_idle(machine_uart_obj_t *self);
#endif

static void machine_uart_fill_rx_ring_buff(machine_uart_obj_t *self) {
    uint32_t available_rx_frames = Cy_SCB_UART_GetNumInRxFifo(self->scb_obj->scb);
    for (uint32_t i = 0; i < available_rx_frames; i++) {
        if (!ringbuf_put(&self->rx_ringbuf, (uint8_t)Cy_SCB_UART_Get(self->scb_obj->scb))) {
            /**
             * No overflow handling.
             * Just return and wait for next interrupt
             * to read the remaining data.
             */
            return;
        }
    }
}

static void machine_uart_scb_isr(mp_obj_t hw_uart_obj) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(hw_uart_obj);
    #if MICROPY_PY_MACHINE_UART_IRQ
    self->mp_irq_flags = 0; // Clear flags at the beginning of the ISR.
    #endif

    if (0UL != (CY_SCB_RX_INTR & Cy_SCB_GetInterruptCause(self->scb_obj->scb))) {
        if (0UL != (CY_SCB_RX_INTR_NOT_EMPTY & Cy_SCB_GetRxInterruptStatusMasked(self->scb_obj->scb))) {
            machine_uart_fill_rx_ring_buff(self);

            #if MICROPY_PY_MACHINE_UART_IRQ
            machine_uart_irq_rx_idle(self);
            #endif

            Cy_SCB_ClearRxInterrupt(self->scb_obj->scb, CY_SCB_RX_INTR_NOT_EMPTY);
        }

        #if MICROPY_PY_MACHINE_UART_IRQ
        if (0UL != (CY_SCB_RX_INTR_UART_BREAK_DETECT & Cy_SCB_GetRxInterruptStatusMasked(self->scb_obj->scb))) {
            machine_uart_irq_rx_break(self);
            Cy_SCB_ClearRxInterrupt(self->scb_obj->scb, CY_SCB_RX_INTR_UART_BREAK_DETECT);
        }
        #endif
    }

    #if MICROPY_PY_MACHINE_UART_IRQ
    if ((0UL != (CY_SCB_TX_INTR & Cy_SCB_GetInterruptCause(self->scb_obj->scb))) &&
        (0UL != (CY_SCB_TX_INTR_UART_DONE & Cy_SCB_GetTxInterruptStatusMasked(self->scb_obj->scb)))) {
        machine_uart_irq_tx_idle(self);
        Cy_SCB_ClearTxInterrupt(self->scb_obj->scb, CY_SCB_TX_INTR_UART_DONE);
    }
    #endif
}

static void machine_uart_baudrate_set(machine_uart_obj_t *self) {
    /**
     * TODO: Review clock configuration and formula to calculate the divider value.
     *       Clock sources, path and proper divider configuration.
     * Given the clock peripheral = 100 MHz
     * Oversampling = 12 (fixed for now)
     * The formula to calculate the divider value is: divider = clock / (baudrate * oversample)
     */
    #define CLOCK_PERIPHERAL_FREQ_HZ (100000000UL)

    /**
     * 16-bit divider 0 (PERI0 group 1) is pre-assigned to the I2C controller by
     * the BSP and must not be disturbed. 16-bit divider 1 is pre-assigned to the
     * BSP debug / REPL UART and is the natural choice for all MicroPython UART
     * instances.
     *
     * TODO: Implement a proper per-SCB divider allocation scheme. The current
     *       approach shares one divider across all UART instances, which means
     *       concurrent UARTs must use the same baud rate.
     */
    #define MACHINE_UART_CLK_DIV_NUM (1UL)

