micropython/micropython/ports/psoc-edge/machine_uart.c
    uint32_t divider = CLOCK_PERIPHERAL_FREQ_HZ / (self->baudrate * 12UL);
    Cy_SysClk_PeriphDisableDivider(CY_SYSCLK_DIV_16_BIT, MACHINE_UART_CLK_DIV_NUM);
    Cy_SysClk_PeriphAssignDivider(self->scb_obj->clk, CY_SYSCLK_DIV_16_BIT, MACHINE_UART_CLK_DIV_NUM);
    Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_16_BIT, MACHINE_UART_CLK_DIV_NUM, divider);
    Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_16_BIT, MACHINE_UART_CLK_DIV_NUM);
}

static inline uint8_t machine_uart_break_width(machine_uart_obj_t *self) {
    return 1 +  // Start bit
           self->bits +
           (self->parity != CY_SCB_UART_PARITY_NONE ? 1 : 0) +
           (self->stop == CY_SCB_UART_STOP_BITS_1 ? 1 : 2) +
           1; // Extra bit, make the frame longer
}

static void machine_uart_hw_init(machine_uart_obj_t *self) {
    cy_stc_scb_uart_config_t config =
    {
        .uartMode = CY_SCB_UART_STANDARD,
        .enableMultiProcessorMode = false,
        .smartCardRetryOnNack = false,
        .irdaInvertRx = false,
        .irdaEnableLowPowerReceiver = false,

        .oversample = 12UL,

        .enableMsbFirst = false,
        .dataWidth = self->bits,
        .parity = self->parity,
        .stopBits = self->stop,
        .enableInputFilter = false,
        .breakWidth = machine_uart_break_width(self),
        .dropOnFrameError = false,
        .dropOnParityError = false,

        .receiverAddress = 0UL,
        .receiverAddressMask = 0UL,
        .acceptAddrInFifo = false,

        /**
         * TODO: Enable CTS/RTS based on user config.
         */
        .enableCts = false,
        .ctsPolarity = CY_SCB_UART_ACTIVE_LOW,
        .rtsRxFifoLevel = 0UL,
        .rtsPolarity = CY_SCB_UART_ACTIVE_LOW,

        .rxFifoTriggerLevel = 0UL,
        .rxFifoIntEnableMask = 0UL,
        .txFifoTriggerLevel = 0UL,
        .txFifoIntEnableMask = 0UL,
    };

    cy_en_scb_uart_status_t rslt = Cy_SCB_UART_Init(self->scb_obj->scb, &config, &self->ctx);
    uart_assert_raise_val("failed to initialize UART hardware, error code: %d", rslt);

    sys_int_init(&(self->scb_obj->irq));
    Cy_SCB_SetRxInterruptMask(self->scb_obj->scb, CY_SCB_RX_INTR_NOT_EMPTY);

    Cy_SCB_UART_Enable(self->scb_obj->scb);
}

static bool machine_uart_rx_wait(machine_uart_obj_t *self, uint32_t timeout_ms) {
    uint32_t timeout_time_ms = mp_hal_ticks_ms() + timeout_ms;

    while (ringbuf_avail(&self->rx_ringbuf) == 0) {
        if (mp_hal_ticks_ms() > timeout_time_ms) {
            return false;
        }
        mp_event_handle_nowait();
    }

    return true;
}

static bool machine_uart_tx_wait(machine_uart_obj_t *self, uint32_t timeout_ms) {
    uint32_t timeout_time_ms = mp_hal_ticks_ms() + timeout_ms;
    while ((Cy_SCB_UART_GetTxFifoStatus(self->scb_obj->scb) & CY_SCB_UART_TX_NOT_FULL) == 0) {
        if (mp_hal_ticks_ms() > timeout_time_ms) {
            return false;
        }
        mp_event_handle_nowait();
    }

    return true;
}

/******************************************************************************/
// MicroPython bindings

static void mp_machine_uart_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "UART(tx="MP_HAL_PIN_FMT ", "
        "rx="MP_HAL_PIN_FMT ", "
        "baudrate=%ld, "
        "bits=%u, "
        "parity=%u, "
        "stop=%u, ",
        mp_hal_pin_name(self->tx),
        mp_hal_pin_name(self->rx),
        self->baudrate,
        self->bits,
        self->parity,
        self->stop
        );

    /**
     * TODO: Implement RTS/CTS flow control print
    if (self->rts != NULL) {
        mp_printf(print, "rts="MP_HAL_PIN_FMT ", ", mp_hal_pin_name(self->rts));
    }

    if (self->cts != NULL) {
        mp_printf(print, "cts="MP_HAL_PIN_FMT ", ", mp_hal_pin_name(self->cts));
    }

     mp_printf(print, "flow=%u, "
    */

    mp_printf(print, "timeout=%ld, "
        "timeout_char=%ld, "
        "rxbuf=%d)",
        /* self->flow, */
        self->timeout_ms,
        self->timeout_char_ms,
        self->rx_ringbuf.size
        );
}


static mp_obj_t mp_machine_uart_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, MP_OBJ_FUN_ARGS_MAX, true);

    machine_uart_obj_t *self = mp_machine_uart_alloc(0);

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_uart_init_helper(self, n_args, args, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

static void mp_machine_uart_deinit(machine_uart_obj_t *self) {
    Cy_SCB_UART_Disable(self->scb_obj->scb, &self->ctx);
    sys_int_deinit(&self->scb_obj->irq);

    m_del(uint8_t, self->rx_ringbuf.buf, self->rx_ringbuf.size);

    machine_scb_obj_free(self->scb_obj);
    mp_machine_uart_free(self);
}

#define DEFAULT_UART_BAUDRATE     (115200)
#define DEFAULT_UART_BITS         (8)
#define DEFAULT_UART_STOP         (1)
#define DEFAULT_UART_RXBUF_SIZE   (256)
/**
 * TODO: Enable CTS/RTS flow control settings and pins
 * Hardware flow control flags (compatible with machine.UART.RTS / machine.UART.CTS)
 *
#define UART_FLOW_CONTROL_NONE    (0)
#define UART_FLOW_CONTROL_RTS     (1)
#define UART_FLOW_CONTROL_CTS     (2)
*/

enum {
    ARG_id,
    ARG_tx, ARG_rx,
    ARG_baudrate, ARG_bits, ARG_parity, ARG_stop,
    /* ARG_rts, ARG_cts, ARG_flow, */
    ARG_timeout, ARG_timeout_char, ARG_rxbuf
};

static const mp_arg_t allowed_args[] = {
    { MP_QSTR_id,           MP_ARG_INT, {.u_int = -1} },
    { MP_QSTR_tx,           MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_rx,           MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_baudrate,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_UART_BAUDRATE} },
    { MP_QSTR_bits,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_UART_BITS} },
    { MP_QSTR_parity,       MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_stop,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_UART_STOP} },
    /* TODO: Enable rts and cts flow control
    { MP_QSTR_rts,          MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_cts,          MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    { MP_QSTR_flow,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = UART_FLOW_CONTROL_NONE} },
    */
    { MP_QSTR_timeout,      MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
    { MP_QSTR_timeout_char, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
    { MP_QSTR_rxbuf,        MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_UART_RXBUF_SIZE} },
};

static void mp_machine_uart_init_helper(machine_uart_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

