micropython/micropython/ports/psoc-edge/machine_uart.c
    /* ARG_id is unused, and ignored in this port.*/

    /* -- TX / RX pins -- */
    self->tx = mp_hal_get_pin_obj(args[ARG_tx].u_obj);
    self->rx = mp_hal_get_pin_obj(args[ARG_rx].u_obj);

    #define MAX_MACHINE_UART_OBJ_AF_PINS 4
    mp_hal_pin_af_config_t uart_pins_config[MAX_MACHINE_UART_OBJ_AF_PINS];

    MP_HAL_PIN_AF_INIT(uart_pins_config[0], self->tx, CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_UART_TX);
    MP_HAL_PIN_AF_INIT(uart_pins_config[1], self->rx, CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_UART_RX);

    uint8_t scb_unit = uart_pins_config[0].af->unit;

    if (self->scb_obj != NULL) {
        mp_machine_uart_deinit(self);
    }
    self->scb_obj = machine_scb_obj_alloc(scb_unit, self, machine_uart_scb_isr);

    uint8_t num_af_pins = 2U; // TX and RX are always present, RTS and CTS are optional depending on flow control settings

    /* -- Flow control pins -- */
    self->flow = 0; // Default to no flow control
    self->rts = NULL;
    self->cts = NULL;

    /**
     * TODO: Enable CTS/RTS
    self->flow = (uint32_t)args[ARG_flow].u_int;

    if (self->flow & UART_FLOW_CONTROL_RTS) {
        if (args[ARG_rts].u_obj == mp_const_none) {
            mp_raise_ValueError(MP_ERROR_TEXT("rts pin required for RTS flow control"));
        }
        self->rts = mp_hal_get_pin_obj(args[ARG_rts].u_obj);
        MP_HAL_PIN_AF_INIT(uart_pins_config[num_af_pins], self->rts, CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_UART_RTS);
        num_af_pins += 1U;
    } else {
        self->rts = NULL;
    }

    if (self->flow & UART_FLOW_CONTROL_CTS) {
        if (args[ARG_cts].u_obj == mp_const_none) {
            mp_raise_ValueError(MP_ERROR_TEXT("cts pin required for CTS flow control"));
        }
        self->cts = mp_hal_get_pin_obj(args[ARG_cts].u_obj);
        MP_HAL_PIN_AF_INIT(uart_pins_config[num_af_pins], self->cts, CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_UART_CTS);
        num_af_pins += 1U;
    } else {
        self->cts = NULL;
    }
    */

    /* Configure the alternate functions for the selected pins */
    mp_hal_periph_pins_af_config(uart_pins_config, num_af_pins);

    /* -- Baudrate -- */
    self->baudrate = (uint32_t)args[ARG_baudrate].u_int;
    if (self->baudrate == 0U) {
        mp_raise_ValueError(MP_ERROR_TEXT("baudrate must be non-zero"));
    }
    machine_uart_baudrate_set(self);

    /* -- Data bits -- */
    int bits = args[ARG_bits].u_int;
    /**
     * TODO: Add support for 7 (or below <8 bits) and 9 bits.
     */
    if (bits != 8) {
        mp_raise_ValueError(MP_ERROR_TEXT("bits must be 8"));
    }
    self->bits = (uint8_t)bits;

    /* -- Parity -- */
    mp_obj_t parity_arg = args[ARG_parity].u_obj;
    if (parity_arg == mp_const_none) {
        self->parity = (uint8_t)CY_SCB_UART_PARITY_NONE;
    } else {
        int p = mp_obj_get_int(parity_arg);
        if (p == 0) {
            self->parity = (uint8_t)CY_SCB_UART_PARITY_EVEN;
        } else if (p == 1) {
            self->parity = (uint8_t)CY_SCB_UART_PARITY_ODD;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("parity must be None, 0 (even) or 1 (odd)"));
        }
    }

    /* -- Stop bits -- */
    int stop = args[ARG_stop].u_int;
    if (stop == 1) {
        self->stop = (uint8_t)CY_SCB_UART_STOP_BITS_1;
    } else if (stop == 2) {
        self->stop = (uint8_t)CY_SCB_UART_STOP_BITS_2;
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("stop bits must be 1 or 2"));
    }

    /* -- Timeouts -- */
    if (args[ARG_timeout].u_int < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("timeout must be non-negative"));
    }
    self->timeout_ms = (uint32_t)args[ARG_timeout].u_int;

    if (args[ARG_timeout_char].u_int < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("timeout_char must be non-negative"));
    }
    self->timeout_char_ms = (uint32_t)args[ARG_timeout_char].u_int;
    /* Make sure timeout_char is at least as long as a whole character (13 bits to be safe). */
    uint32_t min_timeout_char = 13000 / self->baudrate + 1;
    if (self->timeout_char_ms < min_timeout_char) {
        self->timeout_char_ms = min_timeout_char;
    }

    /* -- RX software ring buffer -- */
    ringbuf_alloc(&self->rx_ringbuf, args[ARG_rxbuf].u_int);

    /* -- IRQ init -- */
    #if MICROPY_PY_MACHINE_UART_IRQ
    self->mp_irq_obj = NULL;
    self->mp_irq_trigger = 0;
    self->mp_irq_flags = 0;
    #endif

    /* -- Initialise hardware -- */
    machine_uart_hw_init(self);
}

static mp_int_t mp_machine_uart_any(machine_uart_obj_t *self) {
    return ringbuf_avail(&self->rx_ringbuf);
}

static bool mp_machine_uart_txdone(machine_uart_obj_t *self) {
    return Cy_SCB_UART_IsTxComplete(self->scb_obj->scb);
}

#if MICROPY_PY_MACHINE_UART_SENDBREAK
static void mp_machine_uart_sendbreak(machine_uart_obj_t *self) {
    Cy_SCB_UART_SendBreakBlocking(self->scb_obj->scb, machine_uart_break_width(self));
}
#endif

#if MICROPY_PY_MACHINE_UART_READCHAR_WRITECHAR
static mp_int_t mp_machine_uart_readchar(machine_uart_obj_t *self) {
    if (machine_uart_rx_wait(self, self->timeout_ms)) {
        return (uint8_t)ringbuf_get(&self->rx_ringbuf);
    }

    return MP_STREAM_ERROR;
}

static void mp_machine_uart_writechar(machine_uart_obj_t *self, uint16_t data) {
    if (machine_uart_tx_wait(self, self->timeout_ms)) {
        Cy_SCB_UART_Put(self->scb_obj->scb, (uint32_t)data);
    } else {
        mp_raise_OSError(MP_ETIMEDOUT);
    }
}
#endif

static mp_uint_t mp_machine_uart_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (size == 0) {
        return 0;
    }

    /* wait for first char to become available */
    if (!machine_uart_rx_wait(self, self->timeout_ms)) {
        /* return EAGAIN error to indicate non-blocking (then read() method returns None) */
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    uint32_t read_count = 0;
    uint32_t to_read;
    do {
        to_read = (size < ringbuf_avail(&self->rx_ringbuf)) ? size : ringbuf_avail(&self->rx_ringbuf);
        ringbuf_memcpy_get_internal(&self->rx_ringbuf, (uint8_t *)buf_in + read_count, to_read);
        read_count += to_read;
        size -= to_read;
    } while (size > 0 && machine_uart_rx_wait(self, self->timeout_char_ms));

    return read_count;
}

static mp_uint_t mp_machine_uart_write(mp_obj_t self_in, const void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);

    /* wait to be able to write the first character. */
    if (!machine_uart_tx_wait(self, self->timeout_ms)) {
        /* EAGAIN causes write to return None */
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    uint32_t write_count = 0;
    do {
        uint32_t written = Cy_SCB_UART_PutArray(self->scb_obj->scb, (void *)buf_in, size);
        buf_in = (const uint8_t *)buf_in + written;
        size -= written;
        write_count += written;
    } while (size > 0 && machine_uart_tx_wait(self, self->timeout_char_ms));

