micropython/micropython/ports/psoc-edge/machine_uart.c
    return write_count;
}

static mp_uint_t mp_machine_uart_ioctl(mp_obj_t self_in, mp_uint_t request, uintptr_t arg, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_uint_t ret;
    if (request == MP_STREAM_POLL) {
        uintptr_t flags = arg;
        ret = 0;
        if ((flags & MP_STREAM_POLL_RD) && ringbuf_avail(&self->rx_ringbuf) > 0) {
            ret |= MP_STREAM_POLL_RD;
        }
        if ((flags & MP_STREAM_POLL_WR) && (Cy_SCB_UART_GetTxFifoStatus(self->scb_obj->scb) & CY_SCB_UART_TX_NOT_FULL)) {
            ret |= MP_STREAM_POLL_WR;
        }
    } else if (request == MP_STREAM_FLUSH) {
        /**
         * Estimate the time required to shift out all remaining bytes from the TX hardware pipeline.
         * Cy_SCB_UART_GetNumInTxFifo() returns the exact byte count in the TX FIFO but explicitly
         * excludes the TX shifter register (1 byte). Adding 1 accounts for that shifter. The sum is
         * multiplied by 13 bits per symbol (1 start + 8 data + 2 stop, 1 parity), and multiplied by 2
         * (for safety margin) and divided by the baudrate to get the duration in milliseconds.
         * uint32_t is sufficient: max FIFO is < 256 bytes, so the worst-case duration is well within
         * the uint32_t range even at the lowest supported baud rates.
         */
        uint32_t timeout = mp_hal_ticks_ms() + (1
            + Cy_SCB_UART_GetNumInTxFifo(self->scb_obj->scb)
            ) * 13000 * 2 / self->baudrate;
        do {
            if (mp_machine_uart_txdone(self)) {
                return 0;
            }
            mp_event_handle_nowait();
        } while (mp_hal_ticks_ms() < timeout);
        *errcode = MP_ETIMEDOUT;
        ret = MP_STREAM_ERROR;
    } else {
        *errcode = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
    return ret;
}

#if MICROPY_PY_MACHINE_UART_IRQ

#define MP_UART_ALLOWED_FLAGS (CY_SCB_RX_INTR_NOT_EMPTY | \
    CY_SCB_RX_INTR_UART_BREAK_DETECT | \
    CY_SCB_TX_INTR_UART_DONE)

static void machine_uart_irq_rx_idle(machine_uart_obj_t *self) {
    /**
     * Use CY_SCB_RX_INTR_NOT_EMPTY as RX_IDLE combined with
     * checking if the RX FIFO is empty. Therefore this function
     * will be called after reading all the data in the
     * RX FIFO.
     */
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_RX_INTR_NOT_EMPTY) &&
        (Cy_SCB_UART_GetNumInRxFifo(self->scb_obj->scb) == 0)) {
        self->mp_irq_flags |= CY_SCB_RX_INTR_NOT_EMPTY;
        mp_irq_handler(self->mp_irq_obj);
    }
}

static void machine_uart_irq_rx_break(machine_uart_obj_t *self) {
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_RX_INTR_UART_BREAK_DETECT)) {
        self->mp_irq_flags |= CY_SCB_RX_INTR_UART_BREAK_DETECT;
        mp_irq_handler(self->mp_irq_obj);
    }
}

static void machine_uart_irq_tx_idle(machine_uart_obj_t *self) {
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_TX_INTR_UART_DONE)) {
        self->mp_irq_flags |= CY_SCB_TX_INTR_UART_DONE;
        mp_irq_handler(self->mp_irq_obj);
    }
}

static void machine_uart_irq_scb_config(machine_uart_obj_t *self, bool enable) {
    if (enable) {
        /**
         * CY_SCB_RX_INTR_NOT_EMPTY is always enabled.
         */
        if (self->mp_irq_trigger & CY_SCB_RX_INTR_UART_BREAK_DETECT) {
            /**
             * Clear any stale sticky status before unmasking to prevent a
             * spurious ISR from a break that occurred before this irq() call.
             */
            Cy_SCB_ClearRxInterrupt(self->scb_obj->scb, CY_SCB_RX_INTR_UART_BREAK_DETECT);
            Cy_SCB_SetRxInterruptMask(self->scb_obj->scb, CY_SCB_RX_INTR_UART_BREAK_DETECT | CY_SCB_RX_INTR_NOT_EMPTY);
        }
        if (self->mp_irq_trigger & CY_SCB_TX_INTR_UART_DONE) {
            /**
             * Clear any stale sticky status before unmasking to prevent a
             * spurious ISR from a TX done that occurred before this irq() call.
             */
            Cy_SCB_ClearTxInterrupt(self->scb_obj->scb, CY_SCB_TX_INTR_UART_DONE);
            Cy_SCB_SetTxInterruptMask(self->scb_obj->scb, CY_SCB_TX_INTR_UART_DONE);
        }
    } else {
        /**
         * If disabling, we want to keep the CY_SCB_RX_INTR_NOT_EMPTY
         * enabled to be able to fill the RX ring buffer and avoid data loss.
         */
        Cy_SCB_SetRxInterruptMask(self->scb_obj->scb, CY_SCB_RX_INTR_NOT_EMPTY);
        Cy_SCB_SetTxInterruptMask(self->scb_obj->scb, 0);
    }
}

static mp_uint_t uart_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    machine_uart_irq_scb_config(self, false);
    self->mp_irq_trigger = new_trigger;
    machine_uart_irq_scb_config(self, true);
    return 0;
}

static mp_uint_t uart_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (info_type == MP_IRQ_INFO_FLAGS) {
        return self->mp_irq_flags;
    } else if (info_type == MP_IRQ_INFO_TRIGGERS) {
        return self->mp_irq_trigger;
    }
    return 0;
}

const mp_irq_methods_t uart_irq_methods = {
    .trigger = uart_irq_trigger,
    .info = uart_irq_info,
};

static mp_irq_obj_t *mp_machine_uart_irq(machine_uart_obj_t *self, bool any_args, mp_arg_val_t *args) {
    if (self->mp_irq_obj == NULL) {
        self->mp_irq_trigger = 0;
        self->mp_irq_obj = mp_irq_new(&uart_irq_methods, MP_OBJ_FROM_PTR(self));
    }

    if (any_args) {
        /* Check the handler */
        mp_obj_t handler = args[MP_IRQ_ARG_INIT_handler].u_obj;
        if (handler != mp_const_none && !mp_obj_is_callable(handler)) {
            mp_raise_ValueError(MP_ERROR_TEXT("handler must be None or callable"));
        }

        /* Check the trigger */
        mp_uint_t trigger = args[MP_IRQ_ARG_INIT_trigger].u_int;
        mp_uint_t not_supported = trigger & ~MP_UART_ALLOWED_FLAGS;
        if (trigger != 0 && not_supported) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("trigger 0x%08x unsupported"), not_supported);
        }

        /* Reconfigure user IRQs */
        machine_uart_irq_scb_config(self, false);
        self->mp_irq_obj->handler = handler;
        self->mp_irq_obj->ishard = args[MP_IRQ_ARG_INIT_hard].u_bool;
        self->mp_irq_trigger = trigger;
        machine_uart_irq_scb_config(self, true);
    }

